04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/turbineSiting/constant/atmosphericBoundaryLayerProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      atmosphericBoundaryLayerProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flowDir         (1 0 0);
zDir            (0 0 1);
Uref            10.0;
Zref            20.0;
z0              constant 0.1;
zGround         constant 935.0;

// ************************************************************************* //
